README、仕様書にMermaid記法での図を追加
